MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ128MC708A/mcu.h
#define _IPC11_T6IP2_POSITION                    0x0000000E
#define _IPC11_T6IP2_MASK                        0x00004000
#define _IPC11_T6IP2_LENGTH                      0x00000001

#define _IPC12_T7IP_POSITION                     0x00000000
#define _IPC12_T7IP_MASK                         0x00000007
#define _IPC12_T7IP_LENGTH                       0x00000003

#define _IPC12_SI2C2IP_POSITION                  0x00000004
#define _IPC12_SI2C2IP_MASK                      0x00000070
#define _IPC12_SI2C2IP_LENGTH                    0x00000003

#define _IPC12_MI2C2IP_POSITION                  0x00000008
#define _IPC12_MI2C2IP_MASK                      0x00000700
#define _IPC12_MI2C2IP_LENGTH                    0x00000003

#define _IPC12_T8IP_POSITION                     0x0000000C
#define _IPC12_T8IP_MASK                         0x00007000
#define _IPC12_T8IP_LENGTH                       0x00000003

#define _IPC12_T7IP0_POSITION                    0x00000000
#define _IPC12_T7IP0_MASK                        0x00000001
#define _IPC12_T7IP0_LENGTH                      0x00000001

#define _IPC12_T7IP1_POSITION                    0x00000001
#define _IPC12_T7IP1_MASK                        0x00000002
#define _IPC12_T7IP1_LENGTH                      0x00000001

#define _IPC12_T7IP2_POSITION                    0x00000002
#define _IPC12_T7IP2_MASK                        0x00000004
#define _IPC12_T7IP2_LENGTH                      0x00000001

#define _IPC12_SI2C2IP0_POSITION                 0x00000004
#define _IPC12_SI2C2IP0_MASK                     0x00000010
#define _IPC12_SI2C2IP0_LENGTH                   0x00000001

#define _IPC12_SI2C2IP1_POSITION                 0x00000005
#define _IPC12_SI2C2IP1_MASK                     0x00000020
#define _IPC12_SI2C2IP1_LENGTH                   0x00000001

#define _IPC12_SI2C2IP2_POSITION                 0x00000006
#define _IPC12_SI2C2IP2_MASK                     0x00000040
#define _IPC12_SI2C2IP2_LENGTH                   0x00000001

#define _IPC12_MI2C2IP0_POSITION                 0x00000008
#define _IPC12_MI2C2IP0_MASK                     0x00000100
#define _IPC12_MI2C2IP0_LENGTH                   0x00000001

#define _IPC12_MI2C2IP1_POSITION                 0x00000009
#define _IPC12_MI2C2IP1_MASK                     0x00000200
#define _IPC12_MI2C2IP1_LENGTH                   0x00000001

#define _IPC12_MI2C2IP2_POSITION                 0x0000000A
#define _IPC12_MI2C2IP2_MASK                     0x00000400
#define _IPC12_MI2C2IP2_LENGTH                   0x00000001

#define _IPC12_T8IP0_POSITION                    0x0000000C
#define _IPC12_T8IP0_MASK                        0x00001000
#define _IPC12_T8IP0_LENGTH                      0x00000001

#define _IPC12_T8IP1_POSITION                    0x0000000D
#define _IPC12_T8IP1_MASK                        0x00002000
#define _IPC12_T8IP1_LENGTH                      0x00000001

#define _IPC12_T8IP2_POSITION                    0x0000000E
#define _IPC12_T8IP2_MASK                        0x00004000
#define _IPC12_T8IP2_LENGTH                      0x00000001

#define _IPC13_T9IP_POSITION                     0x00000000
#define _IPC13_T9IP_MASK                         0x00000007
#define _IPC13_T9IP_LENGTH                       0x00000003

#define _IPC13_INT3IP_POSITION                   0x00000004
#define _IPC13_INT3IP_MASK                       0x00000070
#define _IPC13_INT3IP_LENGTH                     0x00000003

#define _IPC13_INT4IP_POSITION                   0x00000008
#define _IPC13_INT4IP_MASK                       0x00000700
#define _IPC13_INT4IP_LENGTH                     0x00000003

#define _IPC13_C2RXIP_POSITION                   0x0000000C
#define _IPC13_C2RXIP_MASK                       0x00007000
#define _IPC13_C2RXIP_LENGTH                     0x00000003

#define _IPC13_T9IP0_POSITION                    0x00000000
#define _IPC13_T9IP0_MASK                        0x00000001
#define _IPC13_T9IP0_LENGTH                      0x00000001

#define _IPC13_T9IP1_POSITION                    0x00000001
#define _IPC13_T9IP1_MASK                        0x00000002
#define _IPC13_T9IP1_LENGTH                      0x00000001

#define _IPC13_T9IP2_POSITION                    0x00000002
#define _IPC13_T9IP2_MASK                        0x00000004
#define _IPC13_T9IP2_LENGTH                      0x00000001

#define _IPC13_INT3IP0_POSITION                  0x00000004
#define _IPC13_INT3IP0_MASK                      0x00000010
#define _IPC13_INT3IP0_LENGTH                    0x00000001

#define _IPC13_INT3IP1_POSITION                  0x00000005
#define _IPC13_INT3IP1_MASK                      0x00000020
#define _IPC13_INT3IP1_LENGTH                    0x00000001

#define _IPC13_INT3IP2_POSITION                  0x00000006
#define _IPC13_INT3IP2_MASK                      0x00000040
#define _IPC13_INT3IP2_LENGTH                    0x00000001

#define _IPC13_INT4IP0_POSITION                  0x00000008
#define _IPC13_INT4IP0_MASK                      0x00000100
#define _IPC13_INT4IP0_LENGTH                    0x00000001

#define _IPC13_INT4IP1_POSITION                  0x00000009
#define _IPC13_INT4IP1_MASK                      0x00000200
#define _IPC13_INT4IP1_LENGTH                    0x00000001

#define _IPC13_INT4IP2_POSITION                  0x0000000A
#define _IPC13_INT4IP2_MASK                      0x00000400
#define _IPC13_INT4IP2_LENGTH                    0x00000001

#define _IPC13_C2RXIP0_POSITION                  0x0000000C
#define _IPC13_C2RXIP0_MASK                      0x00001000
#define _IPC13_C2RXIP0_LENGTH                    0x00000001

#define _IPC13_C2RXIP1_POSITION                  0x0000000D
#define _IPC13_C2RXIP1_MASK                      0x00002000
#define _IPC13_C2RXIP1_LENGTH                    0x00000001

#define _IPC13_C2RXIP2_POSITION                  0x0000000E
#define _IPC13_C2RXIP2_MASK                      0x00004000
#define _IPC13_C2RXIP2_LENGTH                    0x00000001

#define _IPC14_C2IP_POSITION                     0x00000000
#define _IPC14_C2IP_MASK                         0x00000007
#define _IPC14_C2IP_LENGTH                       0x00000003

#define _IPC14_PWMIP_POSITION                    0x00000004
#define _IPC14_PWMIP_MASK                        0x00000070
#define _IPC14_PWMIP_LENGTH                      0x00000003

#define _IPC14_QEIIP_POSITION                    0x00000008
#define _IPC14_QEIIP_MASK                        0x00000700
#define _IPC14_QEIIP_LENGTH                      0x00000003

#define _IPC14_C2IP0_POSITION                    0x00000000
#define _IPC14_C2IP0_MASK                        0x00000001
#define _IPC14_C2IP0_LENGTH                      0x00000001

#define _IPC14_C2IP1_POSITION                    0x00000001
#define _IPC14_C2IP1_MASK                        0x00000002
#define _IPC14_C2IP1_LENGTH                      0x00000001

#define _IPC14_C2IP2_POSITION                    0x00000002
#define _IPC14_C2IP2_MASK                        0x00000004
#define _IPC14_C2IP2_LENGTH                      0x00000001

